# PANDAS

# A. Series
## 1. Series From Array

In [6]:
import pandas as pd

# Array -> Series
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

## 2. Series From Dictionary

In [9]:
# dictionary -> Series
dictionary = {"a": 1, "b": 2, "c": 3}
series = pd.Series(dictionary)
print(series)

a    1
b    2
c    3
dtype: int64

## Custom Indexing in Series

In [12]:
data = [10, 20, 30]
index = ["a", "b", "c"]

pd.Series(data, index)

a    10
b    20
c    30
dtype: int64

# B. DataFrame

## Create DataFrame From Dictionary Of List

In [68]:
data = {
    "Name": ["Prabhjeet", "Raman", "John"],
    "Age": [19, 23, 14],
    "City": ["Delhi", "Ney York", "Bangalore"],
}

dataFrame = pd.DataFrame(data)
print(dataFrame)

        Name  Age       City
0  Prabhjeet   19      Delhi
1      Raman   23   Ney York
2       John   14  Bangalore

## Create DataFrame From List Of Dictionaries

In [69]:
data = [
    {"Name": "Prabhjeet", "Age": 19, "City": "Delhi"},
    {"Name": "Prabhjeet", "Age": 19, "City": "Delhi"},
]
dataFrame = pd.DataFrame(data)
print(dataFrame)

        Name  Age   City
0  Prabhjeet   19  Delhi
1  Prabhjeet   19  Delhi

## Read From Csv and form DataFrame

In [70]:
data = pd.read_csv("salesData.csv")

dataFrame = pd.DataFrame(data)

print(dataFrame.head(5))  # Gets First 5 Elements

   Transaction ID        Date Product Category             Product Name  \
0           10001  2024-01-01      Electronics            iPhone 14 Pro
1           10002  2024-01-02  Home Appliances         Dyson V11 Vacuum
2           10003  2024-01-03         Clothing         Levi's 501 Jeans
3           10004  2024-01-04            Books        The Da Vinci Code
4           10005  2024-01-05  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

In [71]:
data = {
    "Name": ["Prabhjeet", "Raman", "John"],
    "Age": [19, 23, 14],
    "City": ["Delhi", "Ney York", "Bangalore"],
}
dataFrame = pd.DataFrame(data)

dataFrame  # Prints Entire DataFrame

        Name  Age       City
0  Prabhjeet   19      Delhi
1      Raman   23   Ney York
2       John   14  Bangalore

### Accessing DataFrame
- #### Column -> directly Access
- #### Row -> .loc[index] or .loc[rowIndex][colIndex]

### .loc V/S .iloc
- .loc -> Label Based
- .iloc -> Integer Index Based

In [72]:
# Column Access
dataFrame["Name"]  # This Becomes Series as only 1 Column

0    Prabhjeet
1        Raman
2         John
Name: Name, dtype: object

In [73]:
# Row Access
dataFrame.loc[0]  # This Becomes Series as only 1 Row

Name    Prabhjeet
Age            19
City        Delhi
Name: 0, dtype: object

In [74]:
dataFrame.loc[0][0]  # Access First Element

/var/folders/hb/k7qx35xx13dc1rhhhkjbjrnh0000gp/T/ipykernel_25556/1576470724.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dataFrame.loc[0][0]  # Access First Element

'Prabhjeet'

In [75]:
# Access Specified Element
dataFrame.at[1, "Name"]

'Raman'

### Adding Column To DataFrame

In [76]:
dataFrame["Salary"] = [100, 200, 150]
dataFrame

        Name  Age       City  Salary
0  Prabhjeet   19      Delhi     100
1      Raman   23   Ney York     200
2       John   14  Bangalore     150

### Deleting From DataFrame
- #### Column Delete => dataFrame.drop("Salary", axis=1)
- #### A. Temporary Delete dataFrame.drop("Salary",axis = 1, inplace=False)
- #### B. Permanent Delete dataFrame.drop("Salary",axis = 1, inplace=True)

In [77]:
dataFrame.drop("Salary", axis=1)

        Name  Age       City
0  Prabhjeet   19      Delhi
1      Raman   23   Ney York
2       John   14  Bangalore

## Modifying Column of DataFrame

In [78]:
dataFrame

        Name  Age       City  Salary
0  Prabhjeet   19      Delhi     100
1      Raman   23   Ney York     200
2       John   14  Bangalore     150

In [79]:
dataFrame["Age"] = dataFrame["Age"] + 1
dataFrame

        Name  Age       City  Salary
0  Prabhjeet   20      Delhi     100
1      Raman   24   Ney York     200
2       John   15  Bangalore     150

# Important DataFrame 
## .describe()

In [81]:
dataFrame

        Name  Age       City  Salary
0  Prabhjeet   20      Delhi     100
1      Raman   24   Ney York     200
2       John   15  Bangalore     150

In [80]:
dataFrame.describe()

             Age  Salary
count   3.000000     3.0
mean   19.666667   150.0
std     4.509250    50.0
min    15.000000   100.0
25%    17.500000   125.0
50%    20.000000   150.0
75%    22.000000   175.0
max    24.000000   200.0